examples/phtEnthalpyFoam/2dLocalHeatSource/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     phtEnthalpyFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         36000;//144000;//108000;//36000;//

deltaT          5;//30;//0.1;

writeControl    adjustableRunTime;//runTime;

writeInterval   600;//3600;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;//no;

maxCo           200;

functions 
{ 
//    #includeFunc  CourantNo;
//    #includeFunc  singleGraph
//    #includeFunc  probes
}

// ************************************************************************* //
