examples/phtEnthalpyFoam/2dLocalHeatSource/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|h.fluid)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }
	
	"(U|h.fluid)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0.01;
    }

    "(U|h.fluid)Final"
    {
        $U;
        relTol          0;
    }
	
	"(h.solid|e.solid).*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
	
	/*"(h.solid|e.solid)Final"
    {
        $"h.solid";
        relTol          0;
    }*/
}

PIMPLE
{
    momentumPredictor no;
	SIMPLErho yes;
    nOuterCorrectors 2;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       1e5;
	
	residualControl
    {
      /*  U
        {
                tolerance  1e-5;
                relTol      0;
        }
        p
        {
                tolerance  5e-4;
                relTol      0;
        }
		"h.*"
        {
                tolerance  1e-5;
                relTol      0;
        }*/
     }
}

relaxationFactors
{
	/**/fields
    {
        p      0.99;
        pFinal   1;
    }
	
    equations
    {
		"(U|h.fluid|e.fluid|Tc)Final"            1;
	//	U            0.9;
	//	Tc           1;
		h.fluid            0.95;
	//	Tc            0.5;
    //    UEqn            1;
	//	P
	//	"EEqn|TcEqn"    0.3;
    }
}

/********************************************

Information on PIMPLE use for 1D nigmatulinFoam

For cell numbers 20 - 80 recomended 
nCorrectors: 1
nOuterCorrectrors: 2
h equation relaxation: 0.8 - 0.99

For cells 160 - 320
nCorrectors: 2
nOuterCorrectrors: 2 - 4
p relaxation: 0.99 - 1
h equation relaxation: 0.9 - 0.99

For cells 640
nCorrectors: 4
nOuterCorrectrors: 2 - 4
p relaxation: 0.99 - 1
U equation relaxation: 0.9
h equation relaxation: 0.99

When gas viscosity is constant with cells 40
nCorrectors: 1
nOuterCorrectrors: 1
No relaxation

********************************************/


// ************************************************************************* //
